Revit 2024 API
RebarTrimExtendData.GetRebarUpdateCurvesData Method
 Gets a class that contains information used as input and output for rebar free form calculation.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public RebarUpdateCurvesData GetRebarUpdateCurvesData()
Visual Basic
Public Function GetRebarUpdateCurvesData As RebarUpdateCurvesData
Visual C++
public:
RebarUpdateCurvesData^ GetRebarUpdateCurvesData()
Return Value
 Gets a class that contains information used as input and output for rebar free form calculation.
See Also
RebarTrimExtendData Class
Autodesk.Revit.DB.Structure Namespace